# Assignment

For part 3 of the project you will be practicing applying an E.T.L process on your previously saved movie data. Specifically, you will create a new MySQL database after preparing the data for a relational database. You will export your database to a .sql file in your repository using MySQL Workbench.

# Load Libraries

In [1]:
## Standard Imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
## Importing the OS and JSON Modules
import os,json

from sqlalchemy.types import *
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

import warnings
warnings.filterwarnings('ignore')

# Load Basics Data and Normalize

In [2]:
basics = pd.read_csv('Data/title_basics.csv')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

## Column Selection

- Movie ID (tconst)
- Primary Title
- Start Year
- Runtime (in Minutes)
- Genres

In [3]:
basics = basics[['tconst', 'primaryTitle', 'startYear', 'endYear', 'runtimeMinutes',
                      'genres']]
basics.head(2)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70,Drama

## Normalize Genre

In [4]:
# create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70,Drama,[Drama]
2,tt0069049,The Other Side of the Wind,2018.0,NaN,122,Drama,[Drama]
3,tt0088751,The Naked Monster,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,Crime and Punishment,2002.0,NaN,126,Drama,[Drama]

In [5]:
# two columns for gender table
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70,Drama,Drama
2,tt0069049,The Other Side of the Wind,2018.0,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...
81847,tt9916190,Safeguard,2020.0,NaN,95,"Action,Adventure,Thriller",Action
81847,tt9916190,Safeguard,2020.0,NaN,95,"Action,Adventure,Thriller",Adventure
81847,tt9916190,Safeguard,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
81848,tt9916362,Coven,2020.0,NaN,92,"Drama,History",Drama
81848,tt9916362,Coven,2020.0,NaN,92,"Drama,History",History

In [6]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [7]:
## exploding the column of lists
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [8]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [9]:
## make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

In [10]:
#convert the genre map dictionary into a dataframe
# manually make dataframe with named cols from the .keyd and .values
genre_lookup = pd.DataFrame({'Genre_Name': genre_map.keys(),
                            'Genre_ID':genre_map.values()})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

# Load Ratings Data

In [11]:
ratings = pd.read_csv('Data/title_ratings.csv')
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1984
1  tt0000002            5.8       265
2  tt0000005            6.2      2623
3  tt0000006            5.1       182
4  tt0000007            5.4       820

# Load TMDB API Results Data

In [12]:
tmdb = pd.read_csv('Data/tmdb_results_combined.csv')
tmdb.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,"{'id': 1131062, 'name': 'Wong Kar-Wai’s Love T...",150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.111,2248.0,PG

## Column Selection

- Movie ID (imdb_id)
- Revenue
- Budget
- Certification (MPAA Rating)

In [13]:
tmdb = tmdb[['imdb_id', 'revenue', 'budget', 'certification']]
tmdb.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  14204632.0    150000.0            PG

In [14]:
tmdb.drop(0, axis = 'index', inplace=True)

In [15]:
tmdb[tmdb['imdb_id'] == '0']

     imdb_id  revenue  budget certification
1249       0      NaN     NaN           NaN

In [16]:
tmdb.drop(1249, axis='index', inplace=True)

In [17]:
tmdb[tmdb['imdb_id'] == '0']

Empty DataFrame
Columns: [imdb_id, revenue, budget, certification]
Index: []

In [18]:
tmdb.reset_index(drop=True).head()

     imdb_id     revenue      budget certification
0  tt0113026         0.0  10000000.0           NaN
1  tt0113092         0.0         0.0           NaN
2  tt0116391         0.0         0.0           NaN
3  tt0118694  14204632.0    150000.0            PG
4  tt0118852         0.0         0.0             R

# Load

In [19]:
## loading mysql credentials
with open('/Users/osmay/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [20]:
## creating connection to database with sqlalchemy
connection  = f"mysql+pymysql://{login['username']}:{(login['password'])}@localhost/movies"
engine = create_engine(connection)

In [21]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [22]:
# Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
basics_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [23]:
basics = basics[['tconst', 'primaryTitle', 'startYear', 'endYear', 'runtimeMinutes']]
basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70
2,tt0069049,The Other Side of the Wind,2018.0,NaN,122
3,tt0088751,The Naked Monster,2005.0,NaN,100
4,tt0096056,Crime and Punishment,2002.0,NaN,126

In [24]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype=basics_schema,if_exists='replace',index=False)

81849

In [25]:
# Run query to add primary key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [26]:
# show the first 5 rows of the title_basics table
q = """
SELECT *
FROM title_basics
LIMIT 5;"""

In [27]:
## Calculate max string lengths for object columns
key_len = ratings['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
ratings_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [28]:
# Save to sql with dtype and index=False
ratings.to_sql('title_ratings',engine,dtype=ratings_schema,if_exists='replace',index=False)

502900

In [29]:
# Run query to add primary key
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [30]:
# show the first 5 rows of the title_ratings table
q = """
SELECT *
FROM title_ratings
LIMIT 5;"""

In [31]:
## Calculate max string lengths for object columns
key_len = title_genres['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
title_genres_schema = {
    "tconst": String(key_len+1),
    'genre_id':Integer()}

In [32]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,dtype=title_genres_schema,if_exists='replace',index=False)

153377

In [33]:
# Show the first 5 rows of the title_genres
q = """
SELECT *
FROM title_genres
LIMIT 5;
"""

In [34]:
## Calculate max string lengths for object columns
text_len = genre_lookup['Genre_Name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
genres_schema = {
    'Genre_ID':Integer(),
    "Genre_Name": Text(key_len+1)
    }

In [35]:
# Save to sql with dtype and index=False
genre_lookup.to_sql('genres',engine,dtype=genres_schema,if_exists='replace', index=False)

25

In [36]:
# Run query to add primary key
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_ID`);')

In [37]:
# Show the first 5 rows of the title_genres
q = """
SELECT *
FROM genres
LIMIT 5;
"""

In [38]:
## Calculate max string lengths for object columns
key_len = tmdb['imdb_id'].fillna('').map(len).max()
title_len = tmdb['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
tmdb_schema = {
    "imdb_id": String(key_len+1), 
    "certification": Text(title_len+1),
    'budget':Float(),
    'revenue':Float()}

In [39]:
# Save to sql with dtype and index=False
tmdb.to_sql('tmdb_data',engine,dtype=tmdb_schema,if_exists='replace', index=False)

2589

In [40]:
# Run query to add primary key
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [41]:
# Show the first 5 rows of the tmdb
q_tmdb = """
SELECT *
FROM tmdb_data
LIMIT 5;
"""

# Show Tables Query

In [42]:
q = """
SHOW TABLES;
"""

pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data